/*
  ███████████████████████████████████████████████████████████████████
  █▀▀▀▀▀█████▀▄─██▄─▄─▀█▄─▄▄▀█▄─██─▄█▄─▄███▄─▄████▀▄─██─█─███████████
  ███████████─▀─███─▄─▀██─██─██─██─███─██▀██─██▀██─▀─██─▄─███░░██░░██
  ▀▀▀▀▀▀▀▀▀▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▀▄▄▄▄▀▀▄▄▄▄▄▀▄▄▄▄▄▀▄▄▀▄▄▀▄▀▄▀▀▀▄▄▀▀▄▄▀▀
*/

const config = {
    prefix: '-', //برفكس البوت
    token: '', // التوكن
    debug: 'false',
    antispam: 'true',
    serverurl: 'https://discord.gg/',
    embedtitle: '***لفتح تذكرة الرجاء الضغط على الايموجي المناسب لك***',
    embedmsg: '▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬\n**دعم فني عام「🔔」•**\n**شكوى على إداري「📨」•**\n**طلب فك باند「⛔」•**\n**طلب تعويض「💸」•**\n**شكوى على قاتل مأجور「🔪」•**\n**شكوى على عصابة「💊」•**\n**شكوى ضد الامن العام「🚓」•**\n**شكوى ضد وزارة الصحة「🚑」•**\n**شكوى ضد القوات الخاصة「💂🏻‍♂️」•**\n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬',
    embedcolor: '#36393f',
    embedimage: '', //https://i.ibb.co/kct5KcL/logo.png
    errors: {
        title: '⛔ | ERROR',
        already: 'توجد لديك تذكرة سابقة !',
        done: 'سيتم حذف التذكرة بعد `\ثواني معدودة\` من الآن',
        done2: 'سيتم إغلاق التذكرة بعد `\ثواني معدودة\` من الآن',
    },
    antispamC: {
        todelete: '300000', //ملي ثانية - 60000 = دقيقة
        message: '**يمكنك إنشاء تذكرة كل 5 دقائق**',
        messagetodelete: '15000' // كم ملي ثانية وتنحذف الرسالة
    },
    reactions: { //ايموجيات الريأكشن طبعاً مرتبه يعني 0 مع رتبة 0 ورسالة 0 وهكذا 
        r0: '🔔',
        r1: '📨',
        r2: '⛔',
        r3: '💸',
        r4: '🔪',
        r5: '💊',
        r6: '🚓',
        r7: '🚑',
        r8: '💂🏻‍♂️',
        //ريأكشن قفل التذكرة
        c0: '🗑️',
        c1: '🗑️',
        c2: '🗑️', 
        c3: '🗑️',
        c4: '🗑️',
        c5: '🗑️',
        c6: '🗑️',
        c7: '🗑️',
        c8: '🗑️',
        //أغلاق التذكرة
        close: '🔒',
    },
    status: { //true - false / يفعل الرياكشن او يعطله
        n0: 'true',
        n1: 'true',
        n2: 'true',
        n3: 'true',
        n4: 'true',
        n5: 'true',
        n6: 'true',
        n7: 'true',
        n8: 'true',
    },
    roles: { //رتبة المسؤول طبعاً تقدر تحط لكل قسم رتبة أو تخليهم نفس الرتبة كلهم
        r0: '765188111570829342',
        r1: '765188192662978560',
        r2: '765188203912626237',
        r3: '808865447280640120',
        r4: '809477981071999057',
        r5: '809477981969055745',
        r6: '809477983085133844',
        r7: '809477993063514132',
        r8: '809478030157807670',
    },
    category: { //Category tickets id
        c0: '808865492907327508',
        c1: '808880562851807262',
        c2: '808886853675384872', 
        c3: '808886875892088854',
        c4: '809157718228992004',
        c5: '809477529987055673',
        c6: '809477551058976858',
        c7: '809477574341296148',
        c8: '809477593303613481',
    },
    titles: { // العنوان طبعاً مرتبة على حسب الرقم مثلها مثل اللي فوق واللي تحت
        t0: 'دعم فني عام',
        t1: 'شكوى على اداري',
        t2: 'طلب فك باند', 
        t3: 'طلب تعويض', 
        t4: 'شكوى ضد هيتمان', 
        t5: 'شكوى ضد عصابة', 
        t6: 'شكوى ضد الامن العام', 
        t7: 'شكوى ضد وزارة الصحة', 
        t8: 'شكوى ضد القوات الخاصة', 
    },
    messages: { //رسالة بعد مايفتح التذكرة
        m0: ' 🔔 سيتم الرد عليك من قبل الادارين ',
        color0: '#36393f',
        //
        m1: ' 📨 سيتم الدر عليك من قبل مسؤولين الادارة',
        color1: '#36393f',
        //
        m2: ' ⛔ سيتم الرد عليك من قبل مسؤولين الباند', 
        color2: '#36393f',
        //
        m3: ' 💸 سيتم الرد عليك من قبل مسؤولين التعويض',
        color3: '#36393f',
        //
        m4: ' 🔪 سيتم الرد عليك من قبل مسؤولين الهيتمان',
        color4: '#36393f',
        //
        m5: ' 💊 سيتم الرد عليك من قبل مسؤولين العصابات',
        color5: '#36393f',
        //
        m6: ' 🚓 سيتم الرد عليك من قبل مسؤولين الامن العام',
        color6: '#36393f',
        //
        m7: ' 🚑 سيتم الرد عليك من قبل مسؤولين وزارة الصحة',
        color7: '#36393f',
        //
        m8: ' 💂🏻‍♂️ سيتم الرد عليك من قبل مسؤولين القوات الخاصة',
        color8: '#36393f',
    },
    MadeWithRose: 'i1'
}

module.exports = config
